const timeLineData =
  {
    "student": {
      data: [
        {
          text: "من خلال منصتنا، يمكنك إنشاء حساب بوصف تلميذ.",
          color: "#018F69",
        },
        {
          text: "بعد ذلك، سيقوم المدرس بإضافتك إلى الفصول الدراسية  و و ربطك مع ولي أمرك بعد إعطاءه إيميلك الإلكتروني.",
          color: "#FFDB14",
        },
        {
          text: "بعد التواصل مع المدرس، يمكنك تسجيل الدخول إلى حسابك لتجد أنه تم إضافتك إلى ولي أمرك و إضافة فصولك الدراسية.",
          color: "#E17B77",
        },
        {
          text: "من خلال حسابك يمكنك الوصول لفصولك الدراسية لمعرفة ما ستستفيده من فصولك تابع البند التالي",
          color: "#8f017f",
        },
      ],
      steps: {
        data: [
          "رؤية مهامك الدراسية.",
          "رؤية قسم الأسئلة..",
          "رؤية درجاتك.",
          "رؤية جدول الاختبارات.",
          "تقديم تغذية راجعة للمعلم.",
          "رؤية الوسائط التي ينصح بها.",
        ],
        color: "#002470",
      },
    },

    "teacher": {
      data: [
        {
          text: "من خلال منصتنا، يمكنك إنشاء حساب بوصف معلّم.",
          color: "#018f69",
        },
        {
          text: "يمكنك إنشاء فصول دراسية جديدة و إذافة الطلاب لهذه الفصول.",
          color: "#FFDB14",
        },
        {
          text: "من خلال الفصول الدراسية يمكنك إضافة معلومات الطلاب التعليمية و الملاحظات المهمة عنهم.",
          color: "#E17B77",
        },
        {
          text: "من خلال الفصول الدراسية، تستطيع أن تكون على تواصل مع أولياء الأمور لتخفيف العبء الواقعي على كلا الطرفين.",
          color: "#8f017f",
        },
      ],
      steps: {
        data: [
          "إنشاء مهمة دراية جديدة.",
          "الإجابة على الأسئلة الموجودة.",
          "إضافة درجات الطلاب.",
          "إذافة موعد إختبار جديد.",
          "إذافة تكليف جديد.",
          "الإطلاع على أحصائيات التكليفات.",
          "الإطلاع على التغذية الراجعة.",
          "إضافة روابط وسائط إضافية.",
        ],
        color: "#002470",
      },
    },

    "parent": {
      data: [
        {
          text: "من خلال منصتنا، يمكنك إنشاء حساب بوصف ولي أمر.",
          color: "#018f69",
        },
        {
          text: "بعد ذلك، سيقوم المدرس بإضافة أبنائك إلى حسابك بعد إعطاءه رقم هاتفك.",
          color: "#FFDB14",
        },
        {
          text: "بعد التواصل مع المدرس، يمكنك تسجيل الدخول إلى حسابك لتجد أبنائك تمت إضافتهم إلى حسابك.",
          color: "#E17B77",
        },
        {
          text: "من خلال حسابك، يمكنك الوصول إلى صفحات أبنائك الشخصية، و أيضاً مدرسي أبنائك.",
          color: "#8f017f",
        },
      ],
      steps: {
        data: [
          "تعديل معلوماتك.",
          "رؤية حالة أبنائك الصحية.",
          "رؤية درجات أبنائك.",
          "رؤية التقارير و الملاحظات.",
          "رؤية بيانات التواصل مع المعلم.",
          "رؤية نشاطات و مهام الأبناء.",
        ],
        color: "#002470",
      },
    },
  }

export default timeLineData;